app/controllers/tutorials_controller.rb

  def index
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def create
    @tutorial = Tutorial.new(tutorial_params)

    respond_to do |format|
      if @tutorial.save
---
INSERT INTO "tutorials" ("title", "body", "tag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Arduino 101"], ["body", "Tutorial body"], ["tag", "arduino"], ["created_at", "2015-12-05 23:10:43.665308"], ["updated_at", "2015-12-05 23:10:43.665308"]]

  def update
    respond_to do |format|
      if @tutorial.update(tutorial_params)
---
UPDATE "tutorials" SET "body" = ?, "tag" = ?, "updated_at" = ? WHERE "tutorials"."id" = ?  [["body", "https://www.youtube.com/watch?v=5F054MNB1QI"], ["tag", "arduino"], ["updated_at", "2015-12-05 23:28:33.871967"], ["id", 2]]

  def destroy
    @tutorial.destroy
---
DELETE FROM "tutorials" WHERE "tutorials"."id" = ?  [["id", 3]]

    def set_tutorial
      @tutorial = Tutorial.find(params[:id])
---
SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT 1  [["id", 3]]